#!/usr/bin/env python
# -*- coding: utf-8 -*-

# 有一个列表的列表，内层列表的每个值都是包含一个字符的字符串,你可以认为 grid[x][y]是一幅“图”在 x、y 坐标处的字符，该图由文本字符组成。
# 原点(0, 0)在左上角，向右 x 坐标增加，向下 y 坐标增加。复制前面的网格值，编写代码用它打印出图像。

grid = [['.','.','.','.','.','.'],
       ['.','0','0','.','.','.'],
       ['0','0','0','0','.','.'],
       ['0','0','0','0','0','.'],
       ['.','0','0','0','0','0'],
       ['0','0','0','0','0','.'],
       ['0','0','0','0','.','.'],
       ['.','0','0','.','.','.'],
       ['.','.','.','.','.','.']]

l = len(grid[0])        # 定义变量l ，取grid中每个list的长度为6
a = str()        # 定义a为空的字符串
for i in range(l):
    for j in range(len(grid)):        # 嵌套循环，取grid中有几个list，9个
        a += grid[j][i]        # 依次取grid 下标[0][0],[1][0],[2][0],[3][0]...依次类推
    a += "\n"        # 每循环一次下标，换一行，[0][8],[1][8],[2][8]
print(a)